---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.SchemaException
source: html/f61da34c-79b0-683e-a441-21e3eb00c519.htm
---
# SchemaException Methods

Retrieves data needed to serialize the target object.